# PathOfTravelTime Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathOfTravelTime Property
ParameterTypeId Class See Also
---
"Time"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathOfTravelTime { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathOfTravelTime As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathOfTravelTime {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace